stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/examples/usecases/livetune/Conf/FreeRTOSConfig.h
/*
    FreeRTOS V9.0.0 - Copyright (C) 2015 Real Time Engineers Ltd.
    All rights reserved

    VISIT http://www.FreeRTOS.org TO ENSURE YOU ARE USING THE LATEST VERSION.

    ***************************************************************************
     *                                                                       *
     *    FreeRTOS provides completely free yet professionally developed,    *
     *    robust, strictly quality controlled, supported, and cross          *
     *    platform software that has become a de facto standard.             *
     *                                                                       *
     *    Help yourself get started quickly and support the FreeRTOS         *
     *    project by purchasing a FreeRTOS tutorial book, reference          *
     *    manual, or both from: http://www.FreeRTOS.org/Documentation        *
     *                                                                       *
     *    Thank you!                                                         *
     *                                                                       *
    ***************************************************************************

    This file is part of the FreeRTOS distribution.

    FreeRTOS is free software; you can redistribute it and/or modify it under
    the terms of the GNU General Public License (version 2) as published by the
    Free Software Foundation >>>> AND MODIFIED BY <<<< the FreeRTOS exception.

    >>! NOTE: The modification to the GPL is included to allow you to distribute
    >>! a combined work that includes FreeRTOS without being obliged to provide
    >>! the source code for proprietary components outside of the FreeRTOS
    >>! kernel.

    FreeRTOS is distributed in the hope that it will be useful, but WITHOUT ANY
    WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
    FOR A PARTICULAR PURPOSE.  Full license text is available from the following
    link: http://www.freertos.org/a00114.html

    1 tab == 4 spaces!

    ***************************************************************************
     *                                                                       *
     *    Having a problem?  Start by reading the FAQ "My application does   *
     *    not run, what could be wrong?"                                     *
     *                                                                       *
     *    http://www.FreeRTOS.org/FAQHelp.html                               *
     *                                                                       *
    ***************************************************************************

    http://www.FreeRTOS.org - Documentation, books, training, latest versions,
    license and Real Time Engineers Ltd. contact details.

    http://www.FreeRTOS.org/plus - A selection of FreeRTOS ecosystem products,
    including FreeRTOS+Trace - an indispensable productivity tool, a DOS
    compatible FAT file system, and our tiny thread aware UDP/IP stack.

    http://www.OpenRTOS.com - Real Time Engineers ltd license FreeRTOS to High
    Integrity Systems to sell under the OpenRTOS brand.  Low cost OpenRTOS
    licenses offer ticketed support, indemnification and middleware.

    http://www.SafeRTOS.com - High Integrity Systems also provide a safety
    engineered and independently SIL3 certified version for use in safety and
    mission critical applications that require provable dependability.

    1 tab == 4 spaces!
*/
/*
*
* This software component is licensed by ST under Ultimate Liberty license
* SLA0044, the "License"; You may not use this file except in compliance with
* the License. You may obtain a copy of the License at:
*                             www.st.com/SLA0044
*
******************************************************************************
*/
#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

/*-----------------------------------------------------------
 * Application specific definitions.
 *
 * These definitions should be adjusted for your particular hardware and
 * application requirements.
 *
 * THESE PARAMETERS ARE DESCRIBED WITHIN THE 'CONFIGURATION' SECTION OF THE
 * FreeRTOS API DOCUMENTATION AVAILABLE ON THE FreeRTOS.org WEB SITE.
 *
 * See http://www.freertos.org/a00110.html.
 *----------------------------------------------------------*/

/* Ensure stdint is only used by the compiler, and not the assembler. */
#if defined(__ICCARM__) || defined(__CC_ARM) || defined(__GNUC__)
  #include <stdint.h>
  extern uint32_t SystemCoreClock;
#endif

#ifdef STM32H7
  #define CMSIS_device_header "stm32h7xx.h"
  #define USE_CUSTOM_SYSTICK_HANDLER_IMPLEMENTATION         0               /* systick implemented by cmsisos*/

#elif defined(STM32H5)
  #define CMSIS_device_header "stm32h5xx.h"
  #define USE_CUSTOM_SYSTICK_HANDLER_IMPLEMENTATION         1               /* systick implemented by freertos*/

#elif defined(STM32U5)
  #define CMSIS_device_header "stm32u5xx.h"
  #define USE_CUSTOM_SYSTICK_HANDLER_IMPLEMENTATION         1               /* systick implemented by freertos*/

#elif defined(STM32N6)
  #define CMSIS_device_header "stm32n6xx.h"
  #define USE_CUSTOM_SYSTICK_HANDLER_IMPLEMENTATION         1               /* systick implemented by freertos*/

#elif defined(STM32H7S7xx)
  #define CMSIS_device_header "stm32h7s7xx.h"
  #define USE_CUSTOM_SYSTICK_HANDLER_IMPLEMENTATION         0               /* systick implemented by cmsisos*/

#else
  #error "define CMSIS_device_header please"
#endif

#define configENABLE_FPU                         1
#define configENABLE_MPU                         0

#ifdef STM32N6
  /*
  The N6 boots in secure mode, so freetos must use the secure mode, for this project we use the NTZ portable version
  all files from portable/IAR\ARM_CM55_NTZ\non_secure must be added

  */

  #define configENABLE_TRUSTZONE                          0               /* must be set to 0 for NTZ */
  #define configENABLE_MVE                                1               /* must be set to 1 for NTZ */
  #define configRUN_FREERTOS_SECURE_ONLY                  1               /* must be set to 1 for NTZ */
  #define configSUPPORT_STATIC_ALLOCATION                 1               /* must be set to 1 for NTZ , secure mode must manage its own memory  */
  #define configTOTAL_HEAP_SIZE                           (50U*1024U)     /* must be large enough */
  #define configMINIMAL_SECURE_STACK_SIZE                 (8U*1024U)      /* secure size must be set */
#else
  #define configTOTAL_HEAP_SIZE                           (50U*1024U)     /* must be large enough */
#endif


#if defined(USE_LIVETUNE_DESIGNER) || defined(USE_LIVETUNE_TUNER)
  #define USE_FREE_RTOS_IDLE_HANDLER
#endif

#ifdef USE_FREE_RTOS_IDLE_HANDLER
/* Enable CPU load computation using freertos */
#define INCLUDE_xTaskGetIdleTaskHandle (1)
#define traceTASK_SWITCHED_IN()             \
          extern void StartIdleMonitor(void); \
          StartIdleMonitor()
#define traceTASK_SWITCHED_OUT()          \
          extern void EndIdleMonitor(void); \
          EndIdleMonitor()
#else
#define INCLUDE_xTaskGetIdleTaskHandle (0)
#define traceTASK_SWITCHED_IN()
#define traceTASK_SWITCHED_OUT()
#endif

#ifndef configUSE_IDLE_HOOK
  #define configUSE_IDLE_HOOK                 (0)
#endif
#ifndef configUSE_TICK_HOOK
  #define configUSE_TICK_HOOK                 (0)
#endif


#define configUSE_NEWLIB_REENTRANT        (1)   /* allow the re entrance and thread safe for the newlib GCC */

#if  defined ( __GNUC__  )
  #define configNUM_THREAD_LOCAL_STORAGE_POINTERS     (1)       /* IAR v8 Thread local storage, mandatory for IAR RTOS  reentrance*/
  #define configUSE_TRACE_FACILITY                    (1)       /* mandatory for IAR RTOS  reentrance*/

#elif defined(__CC_ARM)
  #define configUSE_DAEMON_TASK_STARTUP_HOOK          (0)

#else
  #define configNUM_THREAD_LOCAL_STORAGE_POINTERS     (1)       /* IAR v8 Thread local storage, mandatory for IAR RTOS  reentrance*/
  #define configUSE_TRACE_FACILITY                    (1)       /* mandatory for IAR RTOS  reentrance*/
  #define configUSE_DAEMON_TASK_STARTUP_HOOK          (1)      /* mandatory for IAR RTOS  reentrance*/
#endif


/*#define configSUPPORT_DYNAMIC_ALLOCATION     1
* #define configENABLE_BACKWARD_COMPATIBILITY     1
*/
#ifdef STM32H5
  #define configENABLE_TRUSTZONE 0
#endif
#define configUSE_PREEMPTION                (1)
#define configUSE_TIME_SLICING              (0)
#define configUSE_TASK_NOTIFICATIONS        (1)
#define configCPU_CLOCK_HZ                  (SystemCoreClock)
#define configTICK_RATE_HZ                  ((TickType_t)1000)
#define configMAX_PRIORITIES                (56)
#define configMINIMAL_STACK_SIZE            ((uint16_t)128) /* sizes in 32bit words */


#define configAPPLICATION_ALLOCATED_HEAP    (0)

#define configMAX_TASK_NAME_LEN             (16)

/*#define configSUPPORT_STATIC_ALLOCATION     (1)
*/
#define configUSE_16_BIT_TICKS              (0)
#define configIDLE_SHOULD_YIELD             (1)
#define configUSE_MUTEXES                   (1)
#define configQUEUE_REGISTRY_SIZE           (16)
#define configCHECK_FOR_STACK_OVERFLOW      (1)
#define configUSE_RECURSIVE_MUTEXES         (1)
#define configUSE_MALLOC_FAILED_HOOK        (0)
#define configUSE_APPLICATION_TASK_TAG      (1)
#define configUSE_COUNTING_SEMAPHORES       (1)
#define configUSE_PORT_OPTIMISED_TASK_SELECTION  (0)
#define configGENERATE_RUN_TIME_STATS       (0)
#define configOVERRIDE_DEFAULT_TICK_CONFIGURATION (0) /* Tickless implementation */

/* Co-routine definitions. */
#define configUSE_CO_ROUTINES                    (0)
#define configMAX_CO_ROUTINE_PRIORITIES          ( 2 )

/* Software timer definitions. */
#define configUSE_TIMERS                         (1)
#define configTIMER_TASK_PRIORITY                ( 2 )
#define configTIMER_QUEUE_LENGTH                 (10)
#define configTIMER_TASK_STACK_DEPTH             (256)

/* CMSIS-RTOS V2 flags */
#define configUSE_OS2_THREAD_SUSPEND_RESUME  (1)
#define configUSE_OS2_THREAD_ENUMERATE       (1)
#define configUSE_OS2_EVENTFLAGS_FROM_ISR    (1)
#define configUSE_OS2_THREAD_FLAGS           (1)
#define configUSE_OS2_TIMER                  (1)
#define configUSE_OS2_MUTEX                  (1)

/* Set the following definitions to 1 to include the API function, or zero
to exclude the API function. */
#define INCLUDE_vTaskPrioritySet             (1)
#define INCLUDE_uxTaskPriorityGet            (1)
#define INCLUDE_vTaskDelete                  (1)
#define INCLUDE_vTaskCleanUpResources        (0)
#define INCLUDE_vTaskSuspend                 (1)
#define INCLUDE_vTaskDelayUntil              (1)
#define INCLUDE_vTaskDelay                   (1)
#define INCLUDE_xTaskGetSchedulerState       (1)
#define INCLUDE_xTimerPendFunctionCall       (1)
#define INCLUDE_xQueueGetMutexHolder         (1)
#define INCLUDE_uxTaskGetStackHighWaterMark  (1)
#define INCLUDE_xTaskGetCurrentTaskHandle    (1)
#define INCLUDE_eTaskGetState                (1)

/*
 * The CMSIS-RTOS V2 FreeRTOS wrapper is dependent on the heap implementation used
 * by the application thus the correct define need to be enabled below
 */
#define USE_FreeRTOS_HEAP_3


/* Cortex-M specific definitions. */
#ifdef __NVIC_PRIO_BITS
  /* __BVIC_PRIO_BITS will be specified when CMSIS is being used. */
  #define configPRIO_BITS         __NVIC_PRIO_BITS
#else
  #define configPRIO_BITS         4
#endif

/* The lowest interrupt priority that can be used in a call to a "set priority"
function. */
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY   0xf

/* The highest interrupt priority that can be used by any interrupt service
routine that makes calls to interrupt safe FreeRTOS API functions.  DO NOT CALL
INTERRUPT SAFE FREERTOS API FUNCTIONS FROM ANY INTERRUPT THAT HAS A HIGHER
PRIORITY THAN THIS! (higher priorities are lower numeric values. */
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 5

/* Interrupt priorities used by the kernel port layer itself.  These are generic
to all Cortex-M ports, and do not rely on any particular library functions. */
#define configKERNEL_INTERRUPT_PRIORITY     ( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )
/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!!
See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY  ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )

/* Normal assert() semantics without relying on the provision of an assert.h
header file. */
/* USER CODE BEGIN 1 */
#define configASSERT( x ) if ((x) == 0) {taskDISABLE_INTERRUPTS(); for( ;; );}
/* USER CODE END 1 */

/* Definitions that map the FreeRTOS port interrupt handlers to their CMSIS
standard names. */
#define vPortSVCHandler    SVC_Handler
#define xPortPendSVHandler PendSV_Handler

/* IMPORTANT: After 10.3.1 update, Systick_Handler comes from NVIC (if SYS timebase = systick), otherwise from cmsis_os2.c */

/* USER CODE BEGIN Defines */
/* Section where parameter definitions can be added (for instance, to override default ones in FreeRTOS.h) */
// To measure mcu load by measure time used in the dummy idle task
#ifndef traceTASK_SWITCHED_OUT
  #define traceTASK_SWITCHED_OUT() xTaskCallApplicationTaskHook( pxCurrentTCB, (void*)1 )
#endif
#ifndef traceTASK_SWITCHED_IN
  #define traceTASK_SWITCHED_IN() xTaskCallApplicationTaskHook( pxCurrentTCB, (void*)0 )
#endif

/****************************************************************************************************************/
/****************************************************************************************************************/
/****************************************************************************************************************/
/*** Workaround for configDEINIT_TLS_BLOCK bug which uses pxCurrentTCB->xTLSBlock instead of pxTCB->xTLSBlock ***/
#define configDEINIT_TLS_BLOCK( dummy )    _reclaim_reent( &( pxTCB->xTLSBlock ) )
/****************************************************************************************************************/
/****************************************************************************************************************/
/****************************************************************************************************************/

/* USER CODE END Defines */


#ifdef  USE_TRACEALYZER
  #ifndef __IASMARM__
    #if ( configUSE_TRACE_FACILITY == 1 )
      #include "trcRecorder.h"
    #endif
  #endif
#endif

#endif /* FREERTOS_CONFIG_H */
